<!-- add-pr-comment:add-pr-comment -->

[command]/home/runner/work/_temp/9913f3a1-7049-4bb8-b797-ff93f0290318/terraform-bin plan -no-color
Acquiring state lock. This may take a few moments...
module.ubuntu_22_04_latest.data.aws_ssm_parameter.this: Reading...
module.ubuntu_22_04_latest.data.aws_ssm_parameter.this: Read complete after 1s [id=/aws/service/canonical/ubuntu/server/22.04/stable/current/amd64/hvm/ebs-gp2/ami-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.task-6-2 will be created
  + resource "aws_instance" "task-6-2" {
      + ami                                  = "ami-0595d6e81396a9efb"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ec2-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.ec2_key_pair will be created
  + resource "aws_key_pair" "ec2_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "ec2-ssh-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_security_group.allow-ssh will be created
  + resource "aws_security_group" "allow-ssh" {
      + arn                    = (known after apply)
      + description            = "allow-ssh"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow 22"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow-ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # local_file.ec2_private_key will be created
  + resource "local_file" "ec2_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "ec2-ssh-key.pem"
      + id                   = (known after apply)
    }

  # tls_private_key.ec2_ssh_key will be created
  + resource "tls_private_key" "ec2_ssh_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "task-6-1-vpc-default"
        }
      + tags_all               = {
          + "Name" = "task-6-1-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "task-6-1-vpc-default"
        }
      + tags_all               = {
          + "Name" = "task-6-1-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "task-6-1-vpc-default"
        }
      + tags_all               = {
          + "Name" = "task-6-1-vpc-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "task-6-1-vpc-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "task-6-1-vpc-ap-northeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "task-6-1-vpc"
        }
      + tags_all = {
          + "Name" = "task-6-1-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "task-6-1-vpc-ap-northeast-1a"
        }
      + tags_all                           = {
          + "Name" = "task-6-1-vpc-ap-northeast-1a"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "task-6-1-vpc-private"
        }
      + tags_all         = {
          + "Name" = "task-6-1-vpc-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "task-6-1-vpc-public"
        }
      + tags_all         = {
          + "Name" = "task-6-1-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "task-6-1-vpc-private-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "task-6-1-vpc-private-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "task-6-1-vpc-public-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "task-6-1-vpc-public-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/20"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "task-6-1-vpc"
        }
      + tags_all                             = {
          + "Name" = "task-6-1-vpc"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Amodule.ubuntu_22_04_latest.data.aws_ssm_parameter.this: Reading...%0Amodule.ubuntu_22_04_latest.data.aws_ssm_parameter.this: Read complete after 1s [id=/aws/service/canonical/ubuntu/server/22.04/stable/current/amd64/hvm/ebs-gp2/ami-id]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.task-6-2 will be created%0A  + resource "aws_instance" "task-6-2" {%0A      + ami                                  = "ami-0595d6e81396a9efb"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "ec2-ssh-key"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = (known after apply)%0A      + tags_all                             = (known after apply)%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A    }%0A%0A  # aws_key_pair.ec2_key_pair will be created%0A  + resource "aws_key_pair" "ec2_key_pair" {%0A      + arn             = (known after apply)%0A      + fingerprint     = (known after apply)%0A      + id              = (known after apply)%0A      + key_name        = "ec2-ssh-key"%0A      + key_name_prefix = (known after apply)%0A      + key_pair_id     = (known after apply)%0A      + key_type        = (known after apply)%0A      + public_key      = (known after apply)%0A      + tags_all        = (known after apply)%0A    }%0A%0A  # aws_security_group.allow-ssh will be created%0A  + resource "aws_security_group" "allow-ssh" {%0A      + arn                    = (known after apply)%0A      + description            = "allow-ssh"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow 22"%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A      + name                   = "allow-ssh"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # local_file.ec2_private_key will be created%0A  + resource "local_file" "ec2_private_key" {%0A      + content              = (sensitive value)%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "400"%0A      + filename             = "ec2-ssh-key.pem"%0A      + id                   = (known after apply)%0A    }%0A%0A  # tls_private_key.ec2_ssh_key will be created%0A  + resource "tls_private_key" "ec2_ssh_key" {%0A      + algorithm                     = "RSA"%0A      + ecdsa_curve                   = "P224"%0A      + id                            = (known after apply)%0A      + private_key_openssh           = (sensitive value)%0A      + private_key_pem               = (sensitive value)%0A      + private_key_pem_pkcs8         = (sensitive value)%0A      + public_key_fingerprint_md5    = (known after apply)%0A      + public_key_fingerprint_sha256 = (known after apply)%0A      + public_key_openssh            = (known after apply)%0A      + public_key_pem                = (known after apply)%0A      + rsa_bits                      = 4096%0A    }%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be created%0A  + resource "aws_default_network_acl" "this" {%0A      + arn                    = (known after apply)%0A      + default_network_acl_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + tags                   = {%0A          + "Name" = "task-6-1-vpc-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "task-6-1-vpc-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + egress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A      + egress {%0A          + action          = "allow"%0A          + cidr_block      = "0.0.0.0/0"%0A          + from_port       = 0%0A          + protocol        = "-1"%0A          + rule_no         = 100%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + ingress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A      + ingress {%0A          + action          = "allow"%0A          + cidr_block      = "0.0.0.0/0"%0A          + from_port       = 0%0A          + protocol        = "-1"%0A          + rule_no         = 100%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be created%0A  + resource "aws_default_route_table" "default" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = (known after apply)%0A      + tags                   = {%0A          + "Name" = "task-6-1-vpc-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "task-6-1-vpc-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + update = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be created%0A  + resource "aws_default_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "task-6-1-vpc-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "task-6-1-vpc-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "task-6-1-vpc-ap-northeast-1a"%0A        }%0A      + tags_all             = {%0A          + "Name" = "task-6-1-vpc-ap-northeast-1a"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be created%0A  + resource "aws_internet_gateway" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "task-6-1-vpc"%0A        }%0A      + tags_all = {%0A          + "Name" = "task-6-1-vpc"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] will be created%0A  + resource "aws_nat_gateway" "this" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "task-6-1-vpc-ap-northeast-1a"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "task-6-1-vpc-ap-northeast-1a"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[0] will be created%0A  + resource "aws_route" "private_nat_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.public_internet_gateway[0] will be created%0A  + resource "aws_route" "public_internet_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "task-6-1-vpc-private"%0A        }%0A      + tags_all         = {%0A          + "Name" = "task-6-1-vpc-private"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "task-6-1-vpc-public"%0A        }%0A      + tags_all         = {%0A          + "Name" = "task-6-1-vpc-public"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "task-6-1-vpc-private-ap-northeast-1a"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "task-6-1-vpc-private-ap-northeast-1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "task-6-1-vpc-public-ap-northeast-1a"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "task-6-1-vpc-public-ap-northeast-1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be created%0A  + resource "aws_vpc" "this" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/20"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "task-6-1-vpc"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "task-6-1-vpc"%0A        }%0A    }%0A%0APlan: 20 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + public_ip = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
